GeehySemi/USART-idle-interrupt-transfer-by-DMA/APM32F10x_SDK_V1.8/Package/SVD/APM32F103xx.svd
						</field>
						<field>
							<name>M2MMODE</name><description>Memory to memory mode</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
					</fields>
				</register>
				<register>
					<name>CHNDATA3</name><displayName>CHNDATA3</displayName>
					
					<description>DMA channel 3 number of data
          register</description>
					<addressOffset>0x34</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue><fields>
						<field>
							<name>NDATA</name>
							<description>Number of data to transfer</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CHPADDR3</name><displayName>CHPADDR3</displayName>
					
					<description>DMA channel 3 peripheral address
          register</description>
					<addressOffset>0x38</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue><fields>
						<field>
							<name>PERADDR</name>
							<description>Peripheral address</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CHMADDR3</name><displayName>CHMADDR3</displayName>
					
					<description>DMA channel 3 memory address
          register</description>
					<addressOffset>0x3C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue><fields>
						<field>
							<name>MEMADDR</name>
							<description>Memory address</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CHCFG4</name><displayName>CHCFG4</displayName>
					
					<description>DMA channel 4 configuration register
					</description>
					<addressOffset>0x44</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue><fields>
						<field>
							<name>CHEN</name><description>Channel enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
						<field>
							<name>TCINTEN</name><description>Transfer complete interrupt
              enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
						<field>
							<name>HTINTEN</name><description>Half Transfer interrupt
              enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
						<field>
							<name>TERRINTEN</name><description>Transfer error interrupt
              enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
						<field>
							<name>DIRCFG</name><description>Data transfer direction</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
						<field>
							<name>CIRMODE</name><description>Circular mode</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
						<field>
							<name>PERIMODE</name><description>Peripheral increment mode</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
						<field>
							<name>MIMODE</name><description>Memory increment mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
						<field>
							<name>PERSIZE</name><description>Peripheral size</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth>
							
							
							
						</field>
						<field>
							<name>MEMSIZE</name><description>Memory size</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth>
							
							
							
						</field>
						<field>
							<name>CHPL</name><description>Channel Priority level</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth>
							
							
							
						</field>
						<field>
							<name>M2MMODE</name><description>Memory to memory mode</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth>
							
							
							
						</field>
					</fields>
				</register>
				<register>
					<name>CHNDATA4</name><displayName>CHNDATA4</displayName>
					
					<description>DMA channel 4 number of data
          register</description>
					<addressOffset>0x48</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue><fields>
						<field>
							<name>NDATA</name>
							<description>Number of data to transfer</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CHPADDR4</name><displayName>CHPADDR4</displayName>
					
					<description>DMA channel 4 peripheral address
          register</description>
					<addressOffset>0x4C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue><fields>
						<field>
							<name>PERADDR</name>
							<description>Peripheral address</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CHMADDR4</name><displayName>CHMADDR4</displayName>
					
					<description>DMA channel 4 memory address
          register</description>
					<addressOffset>0x50</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue><fields>
						<field>
							<name>MEMADDR</name>
							<description>Memory address</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CHCFG5</name><displayName>CHCFG5</displayName>
					
