GeehySemi/USART-idle-interrupt-transfer-by-DMA/APM32F10x_SDK_V1.8/Package/SVD/APM32F103xx.svd
				<register>
					<name>RXMDH1</name><displayName>RXMDH1</displayName><description>CAN receive mailbox High byte data register 1</description><addressOffset>0x1CC</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue><fields>
						<field>
							<name>DATABYTE4</name><description>DATABYTE4</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field><field>
							<name>DATABYTE5</name><description>DATABYTE5</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field><field>
							<name>DATABYTE6</name><description>DATABYTE6</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field><field>
							<name>DATABYTE7</name><description>DATABYTE7</description>
							
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>FCTRL</name>
					<displayName>FCTRL</displayName>
					<description>CAN Filter the master control register</description>
					<addressOffset>0x200</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>FINITEN</name>
							<description>FINITEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CAN2BN</name>
							<description>CAN2BN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>FMCFG</name>
					<displayName>FMCFG</displayName>
					<description>CAN Filter register</description>
					<addressOffset>0x204</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						
						<field>
							<name>FMCFG0</name>
							<description>Filter mode</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FMCFG1</name>
							<description>Filter mode</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FMCFG2</name><description>Filter mode</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FMCFG3</name><description>Filter mode</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FMCFG4</name><description>Filter mode</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FMCFG5</name><description>Filter mode</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FMCFG6</name><description>Filter mode</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FMCFG7</name><description>Filter mode</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FMCFG8</name><description>Filter mode</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FMCFG9</name><description>Filter mode</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FMCFG10</name><description>Filter mode</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FMCFG11</name><description>Filter mode</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FMCFG12</name><description>Filter mode</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FMCFG13</name>
							<description>Filter mode</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FMCFG14</name>
							<description>Filter mode</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FMCFG15</name>
							<description>Filter mode</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FMCFG16</name><description>Filter mode</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FMCFG17</name><description>Filter mode</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FMCFG18</name><description>Filter mode</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FMCFG19</name><description>Filter mode</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FMCFG20</name><description>Filter mode</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FMCFG21</name><description>Filter mode</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FMCFG22</name><description>Filter mode</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FMCFG23</name><description>Filter mode</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FMCFG24</name><description>Filter mode</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FMCFG25</name><description>Filter mode</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FMCFG26</name><description>Filter mode</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FMCFG27</name>
							<description>Filter mode</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>FSCFG</name>
					<displayName>FSCFG</displayName>
					<description>CAN Filter bit width register</description>
					<addressOffset>0x20C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>FSCFG0</name>
							<description>Filter bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FSCFG1</name>
							<description>Filter bit</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FSCFG2</name><description>Filter bit</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FSCFG3</name><description>Filter bit</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FSCFG4</name><description>Filter bit</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FSCFG5</name><description>Filter bit</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FSCFG6</name><description>Filter bit</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FSCFG7</name><description>Filter bit</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FSCFG8</name><description>Filter bit</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FSCFG9</name><description>Filter bit</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FSCFG10</name><description>Filter bit</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FSCFG11</name><description>Filter bit</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FSCFG12</name><description>Filter bit</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FSCFG13</name>
							<description>Filter bit</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FSCFG14</name>
							<description>Filter bit</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FSCFG15</name>
							<description>Filter bit</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FSCFG16</name>
							<description>Filter bit</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FSCFG17</name>
							<description>Filter bit</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FSCFG18</name>
							<description>Filter bit</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FSCFG19</name>
							<description>Filter bit</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FSCFG20</name><description>Filter bit</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FSCFG21</name><description>Filter bit</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FSCFG22</name><description>Filter bit</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FSCFG23</name><description>Filter bit</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FSCFG24</name><description>Filter bit</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FSCFG25</name><description>Filter bit</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FSCFG26</name><description>Filter bit</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FSCFG27</name><description>Filter bit</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>FFASS</name>
					<displayName>FFASS</displayName>
					<description>CAN Filter FIFO associated registers</description>
					<addressOffset>0x214</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>FFASS0</name>
							<description>Filter FIFO assignment for filter</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FFASS1</name>
							<description>Filter FIFO assignment for filter</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FFASS2</name><description>Filter FIFO assignment for filter</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FFASS3</name><description>Filter FIFO assignment for filter</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FFASS4</name><description>Filter FIFO assignment for filter</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FFASS5</name><description>Filter FIFO assignment for filter</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FFASS6</name><description>Filter FIFO assignment for filter</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FFASS7</name><description>Filter FIFO assignment for filter</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FFASS8</name><description>Filter FIFO assignment for filter</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FFASS9</name><description>Filter FIFO assignment for filter</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FFASS10</name><description>Filter FIFO assignment for filter</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FFASS11</name><description>Filter FIFO assignment for filter</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FFASS12</name><description>Filter FIFO assignment for filter</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FFASS13</name>
							<description>Filter FIFO assignment for filter</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FFASS14</name>
							<description>Filter FIFO assignment for filter</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FFASS15</name>
							<description>Filter FIFO assignment for filter</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FFASS16</name>
							<description>Filter FIFO assignment for filter</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FFASS17</name>
							<description>Filter FIFO assignment for filter</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FFASS18</name>
							<description>Filter FIFO assignment for filter</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FFASS19</name>
							<description>Filter FIFO assignment for filter</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FFASS20</name><description>Filter FIFO assignment for filter</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FFASS21</name><description>Filter FIFO assignment for filter</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FFASS22</name><description>Filter FIFO assignment for filter</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FFASS23</name><description>Filter FIFO assignment for filter</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FFASS24</name><description>Filter FIFO assignment for filter</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FFASS25</name><description>Filter FIFO assignment for filter</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FFASS26</name><description>Filter FIFO assignment for filter</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FFASS27</name><description>Filter FIFO assignment for filter</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>FACT</name>
					<displayName>FACT</displayName>
					<description>CAN Filter activation register</description>
					<addressOffset>0x21C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>FACT0</name>
							<description>Filter active</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FACT1</name>
							<description>Filter active</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FACT2</name><description>Filter active</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FACT3</name><description>Filter active</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FACT4</name><description>Filter active</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FACT5</name><description>Filter active</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FACT6</name><description>Filter active</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FACT7</name><description>Filter active</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FACT8</name><description>Filter active</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FACT9</name><description>Filter active</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FACT10</name><description>Filter active</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FACT11</name><description>Filter active</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FACT12</name><description>Filter active</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FACT13</name>
							<description>Filter active</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FACT14</name>
							<description>Filter active</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FACT15</name>
							<description>Filter active</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FACT16</name>
							<description>Filter active</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FACT17</name>
							<description>Filter active</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FACT18</name>
							<description>Filter active</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FACT19</name>
							<description>Filter active</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FACT20</name><description>Filter active</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FACT21</name><description>Filter active</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FACT22</name><description>Filter active</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FACT23</name><description>Filter active</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FACT24</name><description>Filter active</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FACT25</name><description>Filter active</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FACT26</name><description>Filter active</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FACT27</name><description>Filter active</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
