GeehySemi/USART-idle-interrupt-transfer-by-DMA/APM32F10x_SDK_V1.8/Package/SVD/APM32F103xx.svd
			</registers>
		</peripheral><peripheral derivedFrom="I2C1">
			<name>I2C2</name><description>Inter integrated circuit 2</description>
			<baseAddress>0x40005800</baseAddress><addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>I2C2_EV</name>
				<description>I2C2 event interrupt</description>
				<value>33</value>
			</interrupt>
			<interrupt>
				<name>I2C2_ER</name>
				<description>I2C2 error interrupt</description>
				<value>34</value>
			</interrupt>
		</peripheral><peripheral>
			<name>SCI2C1</name>
			<description>Inter integrated circuit 1</description><groupName>SCI2C</groupName>
			<alternatePeripheral>I2C1</alternatePeripheral><baseAddress>0x40005400</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CTRL1</name>
					<displayName>CTRL1</displayName>
					<description>Control register 1</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x003E</resetValue>
					<fields>
						<field>
							<name>MST</name>
							<description>MST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>SPD</name>
							<description>SPD</description>
							<bitOffset>1</bitOffset>
							<bitWidth>2</bitWidth>
						</field><field>
							<name>SAM</name>
							<description>SAM</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>RSTAEN</name>
							<description>RSTAEN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>SLADIS</name>
							<description>SLADIS</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>DSA</name>
							<description>DSA</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TFEIC</name>
							<description>TFEIC</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>RFFIE</name>
							<description>RFFIE</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>DSMA</name>
							<description>DSMA</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TARADDR</name>
					<displayName>TARADDR</displayName>
					<description>Target address register </description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x01055</resetValue>
					<fields>
						<field>
							<name>ADDR</name>
							<description>ADDR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>10</bitWidth>
						</field><field>
							<name>STA</name>
							<description>STA</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>GCEN</name>
							<description>GCEN</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>MAM</name>
							<description>MAM</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>SLAADDR</name>
					<displayName>SLAADDR</displayName>
					<description>Slave address register  </description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0055</resetValue>
					<fields>
						<field>
							<name>ADDR</name>
							<description>ADDR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>10</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>HSMC</name>
					<displayName>HSMC</displayName>
					<description>High speed master code register</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0007</resetValue>
					<fields>
						<field>
							<name>HSMC</name>
							<description>HSMC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>DATA</name>
					<displayName>DATA</displayName>
					<description>Data register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>DATA</name>
							<description>8-bit data register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field><field>
							<name>CMD</name>
							<description>CMD</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>STOP</name>
							<description>STOP</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>SSCHC</name>
					<displayName>SSCHC</displayName>
					<description>Standard speed clock high counter register </description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0190</resetValue>
					<fields>
						<field>
							<name>CNT</name>
							<description>CNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>SSCLC</name>
					<displayName>SSCLC</displayName>
					<description>Standard speed clock low counter register</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x01D6</resetValue>
					<fields>
						<field>
							<name>CNT</name>
							<description>CNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>FSCHC</name>
					<displayName>FSCHC</displayName>
					<description>Fast speed clock high counter register </description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x003C</resetValue>
					<fields>
						<field>
							<name>CNT</name>
							<description>CNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>FSCLC</name>
					<displayName>FSCLC</displayName>
					<description>Fast speed clock low counter register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0082</resetValue>
					<fields>
						<field>
							<name>CNT</name>
							<description>CNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>HSCHC</name>
					<displayName>HSCHC</displayName>
					<description>High speed clock high counter</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0006</resetValue>
					<fields>
						<field>
							<name>CNT</name>
							<description>CNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>HSCLC</name>
					<displayName>HSCLC</displayName>
					<description>High speed clock low counter register</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0010</resetValue>
					<fields>
						<field>
							<name>CNT</name>
							<description>CNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>INTSTS</name>
					<displayName>INTSTS</displayName>
					<description>Interrupt status register</description>
					<addressOffset>0x2C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>RFUIF</name>
							<description>RFUIF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>RFOIF</name>
							<description>RFOIF</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>RFFIF</name>
							<description>RFFIF</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TFOIF</name>
							<description>TFOIF</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TFEIF</name>
							<description>TFEIF</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>RRIF</name>
							<description>RRIF</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TAIF</name>
							<description>TAIF</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>RDIF</name>
							<description>RDIF</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>ACTIF</name>
							<description>ACTIF</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>STPDIF</name>
							<description>STPDIF</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>STADIF</name>
							<description>STADIF</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>GCIF</name>
							<description>GCIF</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>RSTADIF</name>
							<description>RSTADIF</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>MOHIF</name>
							<description>MOHIF</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>INTEN</name>
					<displayName>INTEN</displayName>
					<description>Interrupt enable register</description>
					<addressOffset>0x30</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x08FF</resetValue>
					<fields>
						<field>
							<name>RFUIE</name>
							<description>RFUIE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>RFOIE</name>
							<description>RFOIE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>RFFIE</name>
							<description>RFFIE</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TFOIE</name>
							<description>TFOIE</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TFEIE</name>
							<description>TFEIE</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>RRIE</name>
							<description>RRIE</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TAIE</name>
							<description>TAIE</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>RDIE</name>
							<description>RDIE</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>ACTIE</name>
							<description>ACTIE</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>STPDIE</name>
							<description>STPDIE</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>STADIE</name>
							<description>STADIE</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>GCIE</name>
							<description>GCIE</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>RSTADIE</name>
							<description>RSTADIE</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>MOHIE</name>
							<description>MOHIE</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>RIS</name>
					<displayName>RIS</displayName>
					<description>Raw interrupt status register</description>
					<addressOffset>0x34</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>RFUIF</name>
							<description>RFUIF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>RFOIF</name>
							<description>RFOIF</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>RFFIF</name>
							<description>RFFIF</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TFOIF</name>
							<description>TFOIF</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TFEIF</name>
							<description>TFEIF</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>RRIF</name>
							<description>RRIF</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TAIF</name>
							<description>TAIF</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>RDIF</name>
							<description>RDIF</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>ACTIF</name>
							<description>ACTIF</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>STPDIF</name>
							<description>STPDIF</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>STADIF</name>
							<description>STADIF</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>GCIF</name>
							<description>GCIF</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>RSTADIF</name>
							<description>RSTADIF</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>MOHIF</name>
							<description>MOHIF</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>RFT</name>
					<displayName>RFT</displayName>
					<description>Reception FIFO threshold register  </description>
					<addressOffset>0x38</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>DUALEN</name>
							<description>Dual addressing mode
              enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>ADD2</name>
							<description>Interface address</description>
							<bitOffset>1</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TFT</name>
					<displayName>TFT</displayName>
					<description>Transmission FIFO threshold register </description>
					<addressOffset>0x3C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>RFT</name>
							<description>RFT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>INTCLR</name>
					<displayName>INTCLR</displayName>
					<description>Interruption clear register</description>
					<addressOffset>0x40</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>TFT</name>
							<description>TFT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RFUIC</name>
					<displayName>RFUIC</displayName>
					<description>Reception FIFO underflow interruption clear register</description>
					<addressOffset>0x44</addressOffset>
					<size>0x20</size><access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>INTCLR</name>
							<description>INTCLR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RFOIC</name>
					<displayName>RFOIC</displayName>
					<description>Reception FIFO overflow interruption clear register</description>
					<addressOffset>0x48</addressOffset><size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>RFUIC</name>
							<description>RFUIC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TFOIC</name>
					<displayName>TFOIC</displayName>
					<description>Transmission FIFO overflow interruption clear register</description><addressOffset>0x4C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>RFOIC</name>
							<description>RFOIC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
