GeehySemi/USART-idle-interrupt-transfer-by-DMA/APM32F10x_SDK_V1.8/Package/SVD/APM32F103xx.svd
				<register>
					<name>RRIC</name>
					<displayName>RRIC</displayName>
					<description>Reception request interruption clear register</description><addressOffset>0x50</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>TFOIC</name>
							<description>TFOIC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>TAIC</name>
					<displayName>TAIC</displayName>
					<description>Transmission abort interruption clear register</description><addressOffset>0x54</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>RRIC</name>
							<description>RRIC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>RDIC</name>
					<displayName>RDIC</displayName>
					<description>Receive done interruption clear register</description>
					<addressOffset>0x58</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>RDIC</name>
							<description>RDIC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>AIC</name>
					<displayName>AIC</displayName>
					<description>Activity interruption clear register</description>
					<addressOffset>0x5C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>AIC</name>
							<description>AIC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>STPDIC</name>
					<displayName>STPDIC</displayName>
					<description>Stop detection interruption clear register</description>
					<addressOffset>0x60</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>STPDIC</name>
							<description>STPDIC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>STADIC</name>
					<displayName>STADIC</displayName>
					<description>Start detection interruption clear register</description>
					<addressOffset>0x64</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>STADIC</name>
							<description>STADIC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>GCIC</name>
					<displayName>GCIC</displayName>
					<description>General call interruption clear register</description>
					<addressOffset>0x68</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>GCIC</name>
							<description>GCIC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>CTRL2</name>
					<displayName>CTRL2</displayName>
					<description>Control register  2</description>
					<addressOffset>0x6C</addressOffset><size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>I2CEN</name>
							<description>I2CEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>ABR</name>
							<description>ABR</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TCB</name>
							<description>TCB</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>STS1</name>
					<displayName>STS1</displayName>
					<description>Status register  1</description><addressOffset>0x70</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0006</resetValue>
					<fields>
						<field>
							<name>ACTF</name>
							<description>ACTF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TFNFF</name>
							<description>TFNFF</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TFEF</name>
							<description>TFEF</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>RFNEF</name>
							<description>RFNEF</description>
							<bitOffset>3</bitOffset><bitWidth>1</bitWidth>
						</field><field>
							<name>RFFF</name>
							<description>RFFF</description>
							<bitOffset>4</bitOffset><bitWidth>1</bitWidth>
						</field><field>
							<name>MAF</name>
							<description>MAF</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>SAF</name>
							<description>SAF</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>TFL</name>
					<displayName>TFL</displayName>
					<description>Transmission FIFO level</description><addressOffset>0x74</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>TFL</name>
							<description>TFL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>RFL</name>
					<displayName>RFL</displayName>
					<description>Reception FIFO level</description><addressOffset>0x78</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>RFL</name>
							<description>RFL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>SDAHOLD</name>
					<displayName>SDAHOLD</displayName>
					<description>SDA hold time length register</description><addressOffset>0x7C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0001</resetValue>
					<fields>
						<field>
							<name>TXHOLD</name>
							<description>TXHOLD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field><field>
							<name>RXHOLD</name>
							<description>RXHOLD</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>TAS</name>
					<displayName>TAS</displayName>
					<description>Transmission abort source register</description><addressOffset>0x80</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>AD7NA</name>
							<description>AD7NA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>AD10NA1</name>
							<description>AD10NA1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>AD10NA2</name>
							<description>AD10NA2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TDNA</name>
							<description>TDNA</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>GCNA</name>
							<description>GCNA</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>GCR</name>
							<description>GCR</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>HSAD</name>
							<description>HSAD</description>
							<bitOffset>6</bitOffset><bitWidth>1</bitWidth>
						</field><field>
							<name>SNR</name>
							<description>SNR</description>
							<bitOffset>7</bitOffset><bitWidth>1</bitWidth>
						</field><field>
							<name>RNR10B</name>
							<description>RNR10B</description>
							<bitOffset>8</bitOffset><bitWidth>1</bitWidth>
						</field><field>
							<name>MSTDIS</name>
							<description>MSTDIS</description>
							<bitOffset>9</bitOffset><bitWidth>1</bitWidth>
						</field><field>
							<name>ARBLOST</name>
							<description>ARBLOST</description>
							<bitOffset>10</bitOffset><bitWidth>1</bitWidth>
						</field><field>
							<name>LFTF</name>
							<description>LFTF</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>SAL</name>
							<description>SAL</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>SRI</name>
							<description>SRI</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>USRARB</name>
							<description>USRARB</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>FLUCNT</name>
							<description>FLUCNT</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>SDNO</name>
					<displayName>SDNO</displayName>
					<description>Slave data NACK only register</description><addressOffset>0x84</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>NACK</name>
							<description>NACK</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>DMACTRL</name>
					<displayName>DMACTRL</displayName>
					<description>DMA control register</description><addressOffset>0x88</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>RXEN</name>
							<description>RXEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TXEN</name>
							<description>TXEN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>DTDL</name>
					<displayName>DTDL</displayName>
					<description>DMA transmission data level register</description><addressOffset>0x8C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>DTDL</name>
							<description>DTDL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>DRDL</name>
					<displayName>DRDL</displayName>
					<description>DMA teception data level register</description><addressOffset>0x90</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>DRDL</name>
							<description>DRDL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>SDADLY</name>
					<displayName>SDADLY</displayName>
					<description>SDA delay register</description><addressOffset>0x94</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0064</resetValue>
					<fields>
						<field>
							<name>SDADLY</name>
							<description>SDADLY</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>GCA</name>
					<displayName>GCA</displayName>
					<description>Genernal call ACK register</description><addressOffset>0x98</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0001</resetValue>
					<fields>
						<field>
							<name>GCA</name>
							<description>GCA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>STS2</name>
					<displayName>STS2</displayName>
					<description>Status register2</description><addressOffset>0x9C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>I2CEN</name>
							<description>I2CEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>SDWB</name>
							<description>SDWB</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>SRDL</name>
							<description>SRDL</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>LSSSL</name>
					<displayName>LSSSL</displayName>
					<description>Low speed spike suppression limit</description><addressOffset>0xA0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0005</resetValue>
					<fields>
						<field>
							<name>LSSSL</name>
							<description>LSSSL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>HSSSL</name>
					<displayName>HSSSL</displayName>
					<description>High speed spike suppression limit</description>
					<addressOffset>0xA4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0001</resetValue>
					<fields>
						<field>
							<name>HSSSL</name>
							<description>HSSSL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>SW</name>
					<displayName>SW</displayName>
					<description>Switch register</description>
					<addressOffset>0x100</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>SW</name>
							<description>SW</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
