GeehySemi/USART-idle-interrupt-transfer-by-DMA/APM32F10x_SDK_V1.8/Package/SVD/APM32F103xx.svd
					<description>DMA control register</description>
					<addressOffset>0x48</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>DBADDR</name>
							<description>DMA base address</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
						</field><field>
							<name>DBLEN</name>
							<description>DMA burst length</description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
					</fields>
				</register><register>
					<name>DMADDR</name>
					<displayName>DMADDR</displayName>
					<description>Consecutive DMA addresses</description>
					<addressOffset>0x4C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>DMADDR</name>
							<description>DMA register for burst accesses</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register></registers>
		</peripheral><peripheral derivedFrom="TMR2"><name>TMR5</name><description>General purpose timer</description><baseAddress>0x40000C00</baseAddress><interrupt>
				<name>TMR5</name>
				<description>TMR5 global interrupt</description>
				<value>50</value>
			</interrupt></peripheral><peripheral derivedFrom="TMR2">
			<name>TMR4</name><description>General purpose timer</description>
			<baseAddress>0x40000800</baseAddress>
			<interrupt>
				<name>TMR4</name>
				<description>TMR4 global interrupt</description>
				<value>30</value>
			</interrupt>
		</peripheral><peripheral derivedFrom="TMR2">
			<name>TMR3</name><description>General purpose timer</description>
			<baseAddress>0x40000400</baseAddress>
			<interrupt>
				<name>TMR3</name>
				<description>TMR3 global interrupt</description>
				<value>29</value>
			</interrupt>
		</peripheral><peripheral><name>TMR6</name><description>Advanced timer</description><groupName>TMR</groupName><baseAddress>0x40001000</baseAddress><addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock><interrupt>
				<name>TMR6</name>
				<description>TMR6 global interrupt</description>
				<value>54</value>
			</interrupt><registers>
				<register>
					<name>CTRL1</name>
					<displayName>CTRL1</displayName>
					<description>control register 1</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CNTEN</name>
							<description>Counter enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>UD</name>
							<description>Update disable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>URSSEL</name>
							<description>Update request source</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>SPMEN</name>
							<description>One-pulse mode</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>ARPEN</name>
							<description>Auto-reload preload enable</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL2</name>
					<displayName>CTRL2</displayName>
					<description>control register 2</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CCDSEL</name>
							<description>Capture/compare DMA
              selection</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>MMSEL</name>
							<description>Master mode selection</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				
				<register>
					<name>DIEN</name>
					<displayName>DIEN</displayName>
					<description>DMA/Interrupt enable register</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>UIEN</name>
							<description>Update interrupt enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>UDIEN</name>
							<description>Update DMA request enable</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>STS</name>
					<displayName>STS</displayName>
					<description>status register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>UIFLG</name>
							<description>Update interrupt flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CEG</name>
					<displayName>CEG</displayName>
					<description>event generation register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>UEG</name>
							<description>Update generation</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				
				
				
				
				
				<register>
					<name>CNT</name>
					<displayName>CNT</displayName>
					<description>counter</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CNT</name>
							<description>counter value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>PSC</name>
					<displayName>PSC</displayName>
					<description>prescaler</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PSC</name>
							<description>Prescaler value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>AUTORLD</name>
					<displayName>AUTORLD</displayName>
					<description>auto-reload register</description>
					<addressOffset>0x2C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>AUTORLD</name>
							<description>Auto-reload value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				
				
				
				
				
				
			</registers></peripheral><peripheral derivedFrom="TMR6"><name>TMR7</name><alternatePeripheral/><baseAddress>0x40001400</baseAddress><addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock><interrupt><name>TMR7</name><description>TMR7 global interrupt</description><value>55</value></interrupt></peripheral>
		<peripheral>
			<name>NVIC</name>
			<description>Nested Vectored Interrupt Controller</description><groupName>NVIC</groupName>
			<baseAddress>0xE000E000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1001</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>ICTR</name>
					<displayName>ICTR</displayName>
					<description>Interrupt Controller Type
          Register</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>INTLINESNUM</name>
							<description>Total number of interrupt lines in
              groups</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>STIR</name>
					<displayName>STIR</displayName>
					<description>Software Triggered Interrupt
          Register</description>
					<addressOffset>0xF00</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>INTID</name>
							<description>interrupt to be triggered</description>
							<bitOffset>0</bitOffset>
							<bitWidth>9</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ISER0</name>
					<displayName>ISER0</displayName>
					<description>Interrupt Set-Enable Register</description>
					<addressOffset>0x100</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SETENA</name>
							<description>SETENA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ISER1</name>
					<displayName>ISER1</displayName>
					<description>Interrupt Set-Enable Register</description>
					<addressOffset>0x104</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SETENA</name>
							<description>SETENA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ICER0</name>
					<displayName>ICER0</displayName>
					<description>Interrupt Clear-Enable
          Register</description>
					<addressOffset>0x180</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CLRENA</name>
							<description>CLRENA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ICER1</name>
					<displayName>ICER1</displayName>
					<description>Interrupt Clear-Enable
          Register</description>
					<addressOffset>0x184</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CLRENA</name>
							<description>CLRENA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ISPR0</name>
					<displayName>ISPR0</displayName>
					<description>Interrupt Set-Pending Register</description>
					<addressOffset>0x200</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SETPEND</name>
							<description>SETPEND</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ISPR1</name>
					<displayName>ISPR1</displayName>
					<description>Interrupt Set-Pending Register</description>
					<addressOffset>0x204</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SETPEND</name>
							<description>SETPEND</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ICPR0</name>
					<displayName>ICPR0</displayName>
					<description>Interrupt Clear-Pending
          Register</description>
					<addressOffset>0x280</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CLRPEND</name>
							<description>CLRPEND</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ICPR1</name>
					<displayName>ICPR1</displayName>
					<description>Interrupt Clear-Pending
          Register</description>
					<addressOffset>0x284</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CLRPEND</name>
							<description>CLRPEND</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IABR0</name>
					<displayName>IABR0</displayName>
					<description>Interrupt Active Bit Register</description>
					<addressOffset>0x300</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>ACTIVE</name>
							<description>ACTIVE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IABR1</name>
					<displayName>IABR1</displayName>
					<description>Interrupt Active Bit Register</description>
					<addressOffset>0x304</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>ACTIVE</name>
							<description>ACTIVE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPR0</name>
					<displayName>IPR0</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x400</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IPR_N0</name>
							<description>IPR_N0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N1</name>
							<description>IPR_N1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N2</name>
							<description>IPR_N2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N3</name>
							<description>IPR_N3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPR1</name>
					<displayName>IPR1</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x404</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IPR_N0</name>
							<description>IPR_N0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N1</name>
							<description>IPR_N1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N2</name>
							<description>IPR_N2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N3</name>
							<description>IPR_N3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPR2</name>
					<displayName>IPR2</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x408</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IPR_N0</name>
							<description>IPR_N0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N1</name>
							<description>IPR_N1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N2</name>
							<description>IPR_N2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N3</name>
							<description>IPR_N3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPR3</name>
					<displayName>IPR3</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x40C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IPR_N0</name>
							<description>IPR_N0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N1</name>
							<description>IPR_N1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N2</name>
							<description>IPR_N2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N3</name>
							<description>IPR_N3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPR4</name>
					<displayName>IPR4</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x410</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IPR_N0</name>
							<description>IPR_N0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N1</name>
							<description>IPR_N1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N2</name>
							<description>IPR_N2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N3</name>
							<description>IPR_N3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPR5</name>
					<displayName>IPR5</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x414</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IPR_N0</name>
							<description>IPR_N0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N1</name>
							<description>IPR_N1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N2</name>
							<description>IPR_N2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N3</name>
							<description>IPR_N3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPR6</name>
					<displayName>IPR6</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x418</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IPR_N0</name>
							<description>IPR_N0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N1</name>
							<description>IPR_N1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N2</name>
							<description>IPR_N2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N3</name>
							<description>IPR_N3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPR7</name>
					<displayName>IPR7</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x41C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IPR_N0</name>
							<description>IPR_N0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N1</name>
							<description>IPR_N1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N2</name>
							<description>IPR_N2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N3</name>
							<description>IPR_N3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPR8</name>
					<displayName>IPR8</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x420</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IPR_N0</name>
							<description>IPR_N0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N1</name>
							<description>IPR_N1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N2</name>
							<description>IPR_N2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N3</name>
							<description>IPR_N3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
