GeehySemi/USART-idle-interrupt-transfer-by-DMA/APM32F10x_SDK_V1.8/Package/SVD/APM32F103xx.svd
			</registers>
		</peripheral><peripheral>
			<name>DBGMCU</name>
			<description>Debug support</description><groupName>DBGMCU</groupName>
			<baseAddress>0xE0042000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>IDCODE</name>
					<displayName>IDCODE</displayName>
					<description>DBGMCU_IDCODE</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>EQR</name>
							<description>Equipment Recognition</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
						<field>
							<name>WVR</name>
							<description>Wafer Version Recognition</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CFG</name>
					<displayName>CFG</displayName>
					<description>DBGMCU_CFG</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>SLEEP_CLK_STS</name>
							<description>SLEEP_CLK_STS</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STOP_CLK_STS</name>
							<description>STOP_CLK_STS</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STANDBY_CLK_STS</name>
							<description>STANDBY_CLK_STS</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IOEN</name>
							<description>IOEN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MODE</name>
							<description>MODE</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>IWDT_STS</name>
							<description>IWDT_STS</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WWDT_STS</name>
							<description>WWDT_STS</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TMR1_STS</name>
							<description>TMR1_STS</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TMR2_STS</name>
							<description>TMR2_STS</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TMR3_STS</name>
							<description>TMR3_STS</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TMR4_STS</name>
							<description>TMR4_STS</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CAN1_STS</name>
							<description>CAN1_STS</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C1_SMBUS_TIMEOUT_STS</name>
							<description>I2C1_SMBUS_TIMEOUT_STS</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C2_SMBUS_TIMEOUT_STS</name>
							<description>I2C2_SMBUS_TIMEOUT_STS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TMR8_STS</name>
							<description>TMR8_STS</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TMR5_STS</name>
							<description>TMR5_STS</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TMR6_STS</name>
							<description>TMR6_STS</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TMR7_STS</name>
							<description>TMR7_STS</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CAN2_STS</name>
							<description>CAN2_STS</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TMR12_STS</name>
							<description>TMR12_STS</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TMR13_STS</name>
							<description>TMR13_STS</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TMR14_STS</name>
							<description>TMR14_STS</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TMR9_STS</name>
							<description>TMR9_STS</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TMR10_STS</name>
							<description>TMR10_STS</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>TMR11_STS</name>
							<description>TMR11_STS</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral><peripheral>
			<name>SDIO</name>
			<description>Secure digital input/output
      interface</description><groupName>SDIO</groupName>
			<baseAddress>0x40018000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>SDIO</name>
				<description>SDIO global interrupt</description>
				<value>49</value>
			</interrupt>
			<registers>
				<register>
					<name>PWRCTRL</name>
					<displayName>PWRCTRL</displayName>
					<description>Bits 1:0 = PWRCTRL: Power supply control
          bits</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PWRCTRL</name>
							<description>PWRCTRL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CLKCTRL</name>
					<displayName>CLKCTRL</displayName>
					<description>SDI clock control register
          (SDIO_CLKCR)</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CLKDIV</name>
							<description>Clock divide factor</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CLKEN</name>
							<description>Clock enable bit</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PWRSAV</name>
							<description>Power saving configuration
              bit</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BYPASSEN</name>
							<description>Clock divider bypass enable
              bit</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WBSEL</name>
							<description>Wide bus mode enable bit</description>
							<bitOffset>11</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>DEPSEL</name>
							<description>SDIO_CK dephasing selection
              bit</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HFCEN</name>
							<description>HW Flow Control enable</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ARG</name>
					<displayName>ARG</displayName>
					<description>Bits 31:0 = : Command argument</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CMDARG</name>
							<description>Command argument</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CMD</name>
					<displayName>CMD</displayName>
					<description>SDIO command register
          (SDIO_CMD)</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CMDINDEX</name>
							<description>CMDINDEX</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>WAITRES</name>
							<description>WAITRES</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>WAITINT</name>
							<description>WAITINT</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WENDDATA</name>
							<description>WENDDATA</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CPSMEN</name>
							<description>CPSMEN</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SDIOSC</name>
							<description>SDIOSC</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMDCPEN</name>
							<description>CMDCPEN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>INTEN</name>
							<description>INTEN</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ATACMD</name>
							<description>ATACMD</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CMDRES</name>
					<displayName>CMDRES</displayName>
					<description>SDIO command register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CMDRES</name>
							<description>CMDRES</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RES1</name>
					<displayName>RES1</displayName>
					<description>Bits 31:0 = CARDSTATUS1</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CARDSTS1</name>
							<description>CARDSTS1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RES2</name>
					<displayName>RES2</displayName>
					<description>Bits 31:0 = CARDSTATUS2</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CARDSTS2</name>
							<description>CARDSTS2</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RES3</name>
					<displayName>RES3</displayName>
					<description>Bits 31:0 = CARDSTATUS3</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CARDSTS3</name>
							<description>CARDSTS3</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RES4</name>
					<displayName>RES4</displayName>
					<description>Bits 31:0 = CARDSTATUS4</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CARDSTS4</name>
							<description>CARDSTS4</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DATATIME</name>
					<displayName>DATATIME</displayName>
					<description>Bits 31:0 = DATATIME: Data timeout
          period</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DATATIME</name>
							<description>Data timeout period</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DATALEN</name>
					<displayName>DATALEN</displayName>
					<description>Bits 24:0 = DATALENGTH: Data length
          value</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DATALEN</name>
							<description>Data length value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>25</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DCTRL</name>
					<displayName>DCTRL</displayName>
					<description>SDIO data control register
          (SDIO_DCTRL)</description>
					<addressOffset>0x2C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DTEN</name>
							<description>DTEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DTDRCFG</name>
							<description>DTDRCFG</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DTSEL</name>
							<description>DTSEL</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMAEN</name>
							<description>DMAEN</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBSIZE</name>
							<description>DBSIZE</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>RWSTR</name>
							<description>RWSTR</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RWSTOP</name>
							<description>RWSTOP</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RDWAIT</name>
							<description>RDWAIT</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SDIOF</name>
							<description>SDIOF</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DCNT</name>
					<displayName>DCNT</displayName>
					<description>Bits 24:0 = DATACOUNT: Data count
          value</description>
					<addressOffset>0x30</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DATACNT</name>
							<description>Data count value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>25</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>STS</name>
					<displayName>STS</displayName>
					<description>SDIO status register
          (SDIO_STS)</description>
					<addressOffset>0x34</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>COMRESP</name>
							<description>COMRESP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBDR</name>
							<description>DBDR</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMDRESTO</name>
							<description>CMDRESTO</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DATATO</name>
							<description>DATATO</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXUDRER</name>
							<description>TXUDRER</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXOVRER</name>
							<description>RXOVRER</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMDRES</name>
							<description>CMDRES</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMDSENT</name>
							<description>CMDSENT</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DATAEND</name>
							<description>DATAEND</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SBE</name>
							<description>SBE</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBCP</name>
							<description>DBCP</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMDACT</name>
							<description>CMDACT</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXACT</name>
							<description>TXACT</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXACT</name>
							<description>RXACT</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXFHF</name>
							<description>TXFHF</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXFHF</name>
							<description>RXFHF</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXFF</name>
							<description>TXFF</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXFF</name>
							<description>RXFF</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXFE</name>
							<description>TXFE</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXFE</name>
							<description>RXFE</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXDA</name>
							<description>TXDA</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXDA</name>
							<description>RXDA</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SDIOINT</name>
							<description>SDIOINT</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ATAEND</name>
							<description>ATAEND</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ICF</name>
					<displayName>ICF</displayName>
					<description>SDIO interrupt clear register
          (SDIO_ICF)</description>
					<addressOffset>0x38</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DBCE</name>
							<description>DBCE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CRCE</name>
							<description>CRCE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CRTO</name>
							<description>CRTO</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DTO</name>
							<description>DTO</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXFUE</name>
							<description>TXFUE</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXFOE</name>
							<description>RXFOE</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMDRES</name>
							<description>CMDRES</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMDSENT</name>
							<description>CMDSENT</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DATAEND</name>
							<description>DATAEND</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SBE</name>
							<description>SBE</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBCP</name>
							<description>DBCP</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SDIOIT</name>
							<description>SDIOIT</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ATAEND</name>
							<description>ATAEND</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
