GeehySemi/USART-idle-interrupt-transfer-by-DMA/APM32F10x_SDK_V1.8/Package/SVD/APM32F103xx.svd
				<register>
					<name>MASK</name>
					<displayName>MASK</displayName>
					<description>SDIO mask register (SDIO_MASK)</description>
					<addressOffset>0x3C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CCRCFAIL</name>
							<description>CCRCFAIL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DCRCFAIL</name>
							<description>DCRCFAIL</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMDTO</name>
							<description>CMDTO</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DATATO</name>
							<description>DATATO</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXURER</name>
							<description>TXURER</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXORER</name>
							<description>RXORER</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMDRESRC</name>
							<description>CMDRESRC</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMDSENT</name>
							<description>CMDSENT</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DATAEND</name>
							<description>DATAEND</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STRTER</name>
							<description>STRTER</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBEND</name>
							<description>DBEND</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMDACT</name>
							<description>CMDACT</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXACT</name>
							<description>TXACT</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXACT</name>
							<description>RXACT</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXHFERT</name>
							<description>TXFERT</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXHFFUL</name>
							<description>RXHFFUL</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXFUL</name>
							<description>TXFUL</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXFUL</name>
							<description>RXFUL</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXEPT</name>
							<description>TXEPT</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXFEIE</name>
							<description>RXFEIE</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXDAVB</name>
							<description>TXDAVB</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXDAVB</name>
							<description>RXDAVB</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SDIOINTREC</name>
							<description>SDIOINTREC</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ATACLPREC</name>
							<description>ATACLPREC</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>FIFOCNT</name>
					<displayName>FIFOCNT</displayName>
					<description>Bits 23:0 = FIFOCOUNT: Remaining number of
          words to be written to or read from the
          FIFO</description>
					<addressOffset>0x48</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>FIFOCNT</name>
							<description>FIFOCNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>FIFODATA</name>
					<displayName>FIFODATA</displayName>
					<description>bits 31:0 = FIFOData: Receive and transmit
          FIFO data</description>
					<addressOffset>0x80</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>FIFODATA</name>
							<description>FIFODATA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral><peripheral>
			<name>EMMC</name>
			<description>EMMC Register</description><groupName>EMMC</groupName>
			<alternatePeripheral/><baseAddress>0xA0000000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>EMMC</name>
				<description>EMMC global interrupt</description>
				<value>48</value>
			</interrupt>
			<registers>
				<register>
					<name>CSCTRL1</name>
					<displayName>CSCTRL1</displayName>
					<description>SRAM/NOR-Flash chip-select control register
          1</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x000030D0</resetValue>
					<fields>
						<field>
							<name>WRBURSTEN</name>
							<description>WRBURSTEN</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CRAMPSIZECFG</name>
							<description>CRAMPSIZECFG</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>WSASYNCEN</name>
							<description>WSASYNCEN</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXTMODEEN</name>
							<description>EXTMODEEN</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WAITEN</name>
							<description>WAITEN</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WREN</name>
							<description>WREN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WTIMCFG</name>
							<description>WTIMCFG</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>WRAPBEN</name>
							<description>WRAPBEN</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WSPOLCFG</name>
							<description>WSPOLCFG</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BURSTEN</name>
							<description>BURSTEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>NORFMACCEN</name>
							<description>NORFMACCEN</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MDBWIDCFG</name>
							<description>MDBWIDCFG</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MTYPECFG</name>
							<description>MTYPECFG</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>ADMUXEN</name>
							<description>ADMUXEN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MBKEN</name>
							<description>MBKEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CSTIM1</name>
					<displayName>CSTIM1</displayName>
					<description>SRAM/NOR-Flash chip-select timing register
          1</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xFFFFFFFF</resetValue>
					<fields>
						<field>
							<name>ACCMODECFG</name>
							<description>ACCMODECFG</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>DATALATCFG</name>
							<description>DATALATCFG</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>CLKDIVCFG</name>
							<description>CLKDIVCFG</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>BUSTURNCFG</name>
							<description>BUSTURNCFG</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>DATASETCFG</name>
							<description>DATASETCFG</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>ADDRHLDCFG</name>
							<description>ADDRHLDCFG</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>ADDRSETCFG</name>
							<description>ADDRSETCFG</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CSCTRL2</name><displayName>CSCTRL2</displayName>
					
					<description>SRAM/NOR-Flash chip-select control register
          2</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x000030D0</resetValue><fields>
						<field>
							<name>WRBURSTEN</name>
							<description>WRBURSTEN</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CRAMPSIZECFG</name>
							<description>CRAMPSIZECFG</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>WSASYNCEN</name>
							<description>WSASYNCEN</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXTMODEEN</name><description>EXTMODEEN</description>
							
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WAITEN</name>
							<description>WAITEN</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WREN</name>
							<description>WREN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WTIMCFG</name>
							<description>WTIMCFG</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>WRAPBEN</name>
							<description>WRAPBEN</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WSPOLCFG</name>
							<description>WSPOLCFG</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BURSTEN</name>
							<description>BURSTEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>NORFMACCEN</name>
							<description>NORFMACCEN</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MDBWIDCFG</name>
							<description>MDBWIDCFG</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MTYPECFG</name>
							<description>MTYPECFG</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>ADMUXEN</name>
							<description>ADMUXEN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MBKEN</name>
							<description>MBKEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
					
				</register>
				<register>
					<name>CSTIM2</name><displayName>CSTIM2</displayName>
					
					<description>SRAM/NOR-Flash chip-select timing register
          2</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xFFFFFFFF</resetValue><fields>
						<field>
							<name>ACCMODECFG</name>
							<description>ACCMODECFG</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>DATALATCFG</name>
							<description>DATALATCFG</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>CLKDIVCFG</name>
							<description>CLKDIVCFG</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>BUSTURNCFG</name>
							<description>BUSTURNCFG</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>DATASETCFG</name>
							<description>DATASETCFG</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>ADDRHLDCFG</name>
							<description>ADDRHLDCFG</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>ADDRSETCFG</name>
							<description>ADDRSETCFG</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
					
				</register>
				<register>
					<name>CSCTRL3</name><displayName>CSCTRL3</displayName>
					
					<description>SRAM/NOR-Flash chip-select control register
          3</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x000030D0</resetValue><fields>
						<field>
							<name>WRBURSTEN</name>
							<description>WRBURSTEN</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CRAMPSIZECFG</name>
							<description>CRAMPSIZECFG</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>WSASYNCEN</name>
							<description>WSASYNCEN</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXTMODEEN</name><description>EXTMODEEN</description>
							
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WAITEN</name>
							<description>WAITEN</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WREN</name>
							<description>WREN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WTIMCFG</name>
							<description>WTIMCFG</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>WRAPBEN</name>
							<description>WRAPBEN</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WSPOLCFG</name>
							<description>WSPOLCFG</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BURSTEN</name>
							<description>BURSTEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>NORFMACCEN</name>
							<description>NORFMACCEN</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MDBWIDCFG</name>
							<description>MDBWIDCFG</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MTYPECFG</name>
							<description>MTYPECFG</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>ADMUXEN</name>
							<description>ADMUXEN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MBKEN</name>
							<description>MBKEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
					
				</register>
				<register>
					<name>CSTIM3</name><displayName>CSTIM3</displayName>
					
					<description>SRAM/NOR-Flash chip-select timing register
          3</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xFFFFFFFF</resetValue><fields>
						<field>
							<name>ACCMODECFG</name>
							<description>ACCMODECFG</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>DATALATCFG</name>
							<description>DATALATCFG</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>CLKDIVCFG</name>
							<description>CLKDIVCFG</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>BUSTURNCFG</name>
							<description>BUSTURNCFG</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>DATASETCFG</name>
							<description>DATASETCFG</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>ADDRHLDCFG</name>
							<description>ADDRHLDCFG</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>ADDRSETCFG</name>
							<description>ADDRSETCFG</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
					
				</register>
				<register>
					<name>CSCTRL4</name><displayName>CSCTRL4</displayName>
					
					<description>SRAM/NOR-Flash chip-select control register
          4</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x000030D0</resetValue><fields>
						<field>
							<name>WRBURSTEN</name>
							<description>WRBURSTEN</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>CRAMPSIZECFG</name>
							<description>CRAMPSIZECFG</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>WSASYNCEN</name>
							<description>WSASYNCEN</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXTMODEEN</name><description>EXTMODEEN</description>
							
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WAITEN</name>
							<description>WAITEN</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WREN</name>
							<description>WREN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WTIMCFG</name>
							<description>WTIMCFG</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>WRAPBEN</name>
							<description>WRAPBEN</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WSPOLCFG</name>
							<description>WSPOLCFG</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BURSTEN</name>
							<description>BURSTEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>NORFMACCEN</name>
							<description>NORFMACCEN</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MDBWIDCFG</name>
							<description>MDBWIDCFG</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MTYPECFG</name>
							<description>MTYPECFG</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>ADMUXEN</name>
							<description>ADMUXEN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MBKEN</name>
							<description>MBKEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
					
				</register>
				<register>
					<name>CSTIM4</name><displayName>CSTIM4</displayName>
					
					<description>SRAM/NOR-Flash chip-select timing register
          4</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xFFFFFFFF</resetValue><fields>
						<field>
							<name>ACCMODECFG</name>
							<description>ACCMODECFG</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>DATALATCFG</name>
							<description>DATALATCFG</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>CLKDIVCFG</name>
							<description>CLKDIVCFG</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>BUSTURNCFG</name>
							<description>BUSTURNCFG</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>DATASETCFG</name>
							<description>DATASETCFG</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>ADDRHLDCFG</name>
							<description>ADDRHLDCFG</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>ADDRSETCFG</name>
							<description>ADDRSETCFG</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
					
				</register>
