GeehySemi/USART-idle-interrupt-transfer-by-DMA/APM32F10x_SDK_V1.8/Package/SVD/APM32F103xx.svd
				<register>
					<name>CTRL2</name>
					<displayName>CTRL2</displayName>
					<description>PC Card/NAND Flash control register
          2</description>
					<addressOffset>0x60</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000018</resetValue>
					<fields>
						<field>
							<name>ECCPSCFG</name>
							<description>ECCPSCFG</description>
							<bitOffset>17</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>A2RDCFG</name>
							<description>A2RDCFG</description>
							<bitOffset>13</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>C2RDCFG</name>
							<description>C2RDCF</description>
							<bitOffset>9</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>ECCEN</name>
							<description>ECCEN</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBWIDCFG</name>
							<description>DBWIDCFG</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MTYPECFG</name>
							<description>MTYPECFG</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MBKEN</name>
							<description>MBKEN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WAITFEN</name>
							<description>WAITFEN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>STSINT2</name>
					<displayName>STSINT2</displayName>
					<description>FIFO status and interrupt register
          2</description>
					<addressOffset>0x64</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000040</resetValue>
					<fields>
						<field>
							<name>FEFLG</name>
							<description>FEFLG</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IFEDEN</name>
							<description>IFEDEN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IHLDEN</name>
							<description>IHLDEN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IREDEN</name>
							<description>IREDEN</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IFEFLG</name>
							<description>IFEFLG</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IHLFLG</name>
							<description>IHLFLG</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IREFLG</name>
							<description>IREFLG</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CMSTIM2</name>
					<displayName>CMSTIM2</displayName>
					<description>Common memory space timing register
          2</description>
					<addressOffset>0x68</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xFCFCFCFC</resetValue>
					<fields>
						<field>
							<name>HIZ2</name>
							<description>Common memory 2 databus HiZ time</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>HLD2</name>
							<description>Common memory 2 hold time</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>WAIT2</name>
							<description>Common memory 2 wait time</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>SET2</name>
							<description>Common memory 2 setup time</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>AMSTIM2</name>
					<displayName>AMSTIM2</displayName>
					<description>Attribute memory space timing register
          2</description>
					<addressOffset>0x6C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xFCFCFCFC</resetValue>
					<fields>
						<field>
							<name>HIZ2</name>
							<description>Attribute memory 2 databus HiZ
time</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>HLD2</name>
							<description>Attribute memory 2 hold
time</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>WAIT2</name>
							<description>Attribute memory 2 wait
time</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>SET2</name>
							<description>Attribute memory 2 setup time</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ECCRS2</name>
					<displayName>ECCRS2</displayName>
					<description>ECC result register 2</description>
					<addressOffset>0x74</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>ECCRS2</name>
							<description>ECC result 2</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL3</name><displayName>CTRL3</displayName>
					
