GeehySemi/USART-idle-interrupt-transfer-by-DMA/APM32F10x_SDK_V1.8/Package/SVD/APM32F103xx.svd
					<description>PC Card/NAND Flash control register
          4</description>
					<addressOffset>0xA0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000018</resetValue><fields>
						<field>
							<name>ECCPSCFG</name>
							<description>ECCPSCFG</description>
							<bitOffset>17</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>A2RDCFG</name>
							<description>A2RDCFG</description>
							<bitOffset>13</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>C2RDCFG</name>
							<description>C2RDCF</description>
							<bitOffset>9</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>ECCEN</name>
							<description>ECCEN</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBWIDCFG</name>
							<description>DBWIDCFG</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MTYPECFG</name>
							<description>MTYPECFG</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MBKEN</name>
							<description>MBKEN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WAITFEN</name>
							<description>WAITFEN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
					
				</register>
				<register>
					<name>STSINT4</name><displayName>STSINT4</displayName>
					
					<description>FIFO status and interrupt register
          4</description>
					<addressOffset>0xA4</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000040</resetValue><fields>
						<field>
							<name>FEFLG</name>
							<description>FEFLG</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IFEDEN</name>
							<description>IFEDEN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IHLDEN</name>
							<description>IHLDEN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IREDEN</name>
							<description>IREDEN</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IFEFLG</name>
							<description>IFEFLG</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IHLFLG</name>
							<description>IHLFLG</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IREFLG</name>
							<description>IREFLG</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
					
				</register>
				<register>
					<name>CMSTIM4</name><displayName>CMSTIM4</displayName>
					
					<description>Common memory space timing register
          4</description>
					<addressOffset>0xA8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xFCFCFCFC</resetValue><fields>
						<field>
							<name>HIZ4</name>
							<description>Common memory 4 databus HiZ time</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>HLD4</name>
							<description>Common memory 4 hold time</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>WAIT4</name>
							<description>Common memory 4 wait time</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>SET4</name>
							<description>Common memory 4 setup time</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
					
				</register>
				<register>
					<name>AMSTIM4</name><displayName>AMSTIM4</displayName>
					
					<description>Attribute memory space timing register
          4</description>
					<addressOffset>0xAC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xFCFCFCFC</resetValue><fields>
						<field>
							<name>HIZ4</name>
							<description>Attribute memory 4 databus HiZ
time</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>HLD4</name>
							<description>Attribute memory 4 hold
time</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>WAIT4</name>
							<description>Attribute memory 4 wait
time</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>SET4</name>
							<description>Attribute memory 4 setup time</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
					
				</register>
				<register>
					<name>IOSTIM4</name>
					<displayName>IOSTIM4</displayName>
					<description>I/O space timing register 4</description>
					<addressOffset>0xB0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xFCFCFCFC</resetValue>
					<fields>
						<field>
							<name>HIZ4</name><description>HIZ4</description>
							
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>HLD4</name><description>HLD4</description>
							
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>WAIT4</name><description>WAIT4</description>
							
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>SET4</name><description>SET4</description>
							
