GeehySemi/USART-idle-interrupt-transfer-by-DMA/APM32F10x_SDK_V1.8/Package/SVD/APM32F103xx.svd
			</registers>
		</peripheral><peripheral>
			<name>DMC</name>
			<description>Dynamic memory controler</description><groupName>DMC</groupName>
			<alternatePeripheral>EMMC</alternatePeripheral><baseAddress>0xA0000000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CFG</name>
					<displayName>CFG</displayName>
					<description>Configuraion register</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00141388</resetValue>
					<fields>
						<field>
							<name>BAWCFG</name>
							<description>BAWCFG</description>
							<bitOffset>3</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>RAWCFG</name>
							<description>RAWCFG</description>
							<bitOffset>5</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>CAWCFG</name>
							<description>CAWCFG</description>
							<bitOffset>9</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>DWCFG</name>
							<description>DWCFG</description>
							<bitOffset>13</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIM0</name>
					<displayName>TIM0</displayName>
					<description>Timing register 0</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x019A5252</resetValue>
					<fields>
						<field>
							<name>CASLSEL0</name>
							<description>CASLSEL0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>RASMINTSEL</name>
							<description>RASMINTSEL</description>
							<bitOffset>2</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>DTIMSEL</name>
							<description>DTIMSEL</description>
							<bitOffset>6</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>PCPSEL</name>
							<description>PCPSEL</description>
							<bitOffset>9</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>WRTIMSEL</name>
							<description>WRTIMSEL</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>ARPSEL</name>
							<description>ARPSEL</description>
							<bitOffset>14</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>XSR0</name>
							<description>XSR0</description>
							<bitOffset>18</bitOffset>
							<bitWidth>4</bitWidth>
						</field><field>
							<name>ATACP</name>
							<description>ATACP</description>
							<bitOffset>22</bitOffset>
							<bitWidth>4</bitWidth>
						</field><field>
							<name>ECASLSEL1</name>
							<description>ECASLSEL1</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>EXSR1</name>
							<description>EXSR1</description>
							<bitOffset>27</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIM1</name>
					<displayName>TIM1</displayName>
					<description>Timing register 1</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00074E20</resetValue>
					<fields>
						<field>
							<name>STBTIM</name>
							<description>STBTIM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field><field>
							<name>ARNUMCFG</name>
							<description>ARNUMCFG</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL1</name>
					<displayName>CTRL1</displayName>
					<description>Control register 1</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					
					<resetValue>0x00003049</resetValue>
					<fields>
						<field>
							<name>INIT</name>
							<description>INIT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth><access>read-write</access>
						</field><field>
							<name>SRMEN</name>
							<description>SRMEN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth><access>read-write</access>
						</field><field>
							<name>PDMEN</name>
							<description>PDMEN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth><access>read-write</access>
						</field><field>
							<name>PCACFG</name>
							<description>PCACFG</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth><access>read-write</access>
						</field><field>
							<name>FRBSREN</name>
							<description>FRBSREN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth><access>read-write</access>
						</field><field>
							<name>FRASREN</name>
							<description>FRASREN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth><access>read-write</access>
						</field><field>
							<name>RDNUMMCFG</name><description>RDNUMCFG</description>
							
							<bitOffset>6</bitOffset>
							<bitWidth>3</bitWidth><access>read-write</access>
						</field><field>
							<name>MODESET</name>
							<description>MODESET</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth><access>read-write</access>
						</field><field>
							<name>SRMFLG</name>
							<description>SRMFLG</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth><access>read-only</access>
						</field><field>
							<name>BANKNUMCFG</name>
							<description>BANKNUMCFG</description>
							<bitOffset>12</bitOffset>
							<bitWidth>5</bitWidth><access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>REF</name>
					<displayName>REF</displayName>
					<description>refresh register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x000000C3</resetValue>
					<fields>
						<field>
							<name>RCYCCFG</name>
							<description>RCYCCFG</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CHIPSEL</name>
					<displayName>CHIPSEL</displayName>
					<description>Chip select register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>BACHIPSEL</name>
							<description>BACHIPSEL</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>MASK</name>
					<displayName>MASK</displayName>
					<description>Mask register</description>
					<addressOffset>0x54</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000000D</resetValue>
					<fields>
						<field>
							<name>MSIZESEL</name>
							<description>MSIZESEL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
						</field><field>
							<name>MTYPESEL</name>
							<description>MTYPESEL</description>
							<bitOffset>5</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SW</name>
					<displayName>SW</displayName>
					<description>switch register</description>
					<addressOffset>0x400</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MCSW</name>
							<description>Memory Controller Function Switch</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL2</name>
					<displayName>CTRL2</displayName>
					<description>Control register 2</description>
					<addressOffset>0x404</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000002E</resetValue>
					<fields>
						<field>
							<name>CPHACFG</name>
							<description>CPHACFG</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RDDEN</name>
							<description>RDDEN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RDDCFG</name>
							<description>RDDCFG</description>
							<bitOffset>2</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>WPEN</name>
							<description>WPEN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>BUFFEN</name>
							<description>BUFFEN</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field><field>
							<name>WRPBSEL</name>
							<description>WRPBSEL</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
